ka2_2024/src/ChartsOfCharacteristicTypes/АналитикиСтатейБюджетов/АналитикиСтатейБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>АналитикиСтатейБюджетов</name>
  <type>
    <types>CatalogRef.ВидыНоменклатуры</types>
    <types>EnumRef.ТипыЗатратРегл</types>
    <types>CatalogRef.ОбъектыЭксплуатации</types>
    <types>CatalogRef.МаркетинговыеМероприятия</types>
    <types>CatalogRef.Номенклатура</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    <types>CatalogRef.СтатьиКалькуляции</types>
    <types>CatalogRef.Сотрудники</types>
    <types>DocumentRef.ЗаказПоставщику</types>
    <types>CatalogRef.СерииНоменклатуры</types>
    <types>CatalogRef.НематериальныеАктивы</types>
    <types>CatalogRef.ОбъектыРасчетов</types>
    <types>CatalogRef.Валюты</types>
    <types>EnumRef.ТипыНоменклатуры</types>
    <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
    <types>CatalogRef.СегментыПартнеров</types>
    <types>EnumRef.ДвиженияЦелевыхСредств</types>
    <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>CatalogRef.ЗначенияСвойствОбъектовИерархия</types>
    <types>EnumRef.ТипыДенежныхСредств</types>
    <types>DocumentRef.ЗаказПереработчику</types>
    <types>CatalogRef.СоглашенияСПоставщиками</types>
    <types>CatalogRef.КассыККМ</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.КоллекцииНоменклатуры</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.ОбъектыСтроительства</types>
    <types>CatalogRef.ЦелевыеСредства</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
    <types>CatalogRef.Марки</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>DocumentRef.ЗаказНаСборку</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.СоглашенияСКлиентами</types>
    <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    <types>CatalogRef.Контрагенты</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    <types>CatalogRef.Партнеры</types>
    <types>CatalogRef.НаправленияИспользованияПрибыли</types>
    <types>EnumRef.ТипыНалогов</types>
    <types>CatalogRef.ПрочиеАктивыПассивы</types>
    <types>DocumentRef.ЗаказНаПеремещение</types>
    <types>CatalogRef.Производители</types>
    <types>CatalogRef.СделкиСКлиентами</types>
    <types>CatalogRef.ФорматыМагазинов</types>
    <types>CatalogRef.ЦенныеБумаги</types>
    <types>CatalogRef.ЦеновыеГруппы</types>
    <types>EnumRef.СпособыСтроительства</types>
    <types>CatalogRef.НаправленияДеятельности</types>
    <types>CatalogRef.Кассы</types>
    <types>DocumentRef.ЗаказПереработчику2_5</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    <types>CatalogRef.ДоговорыАренды</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.СезонныеГруппы</types>
    <types>CatalogRef.СегментыНоменклатуры</types>
    <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
    <types>CatalogRef.БизнесРегионы</types>
    <types>DocumentRef.ЗаказКлиента</types>
    <types>CatalogRef.Проекты</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.ПрочиеРасходы</types>
    <types>CatalogRef.Резервы</types>
    <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
    <types>CatalogRef.ТоварныеКатегории</types>
    <types>EnumRef.ВидыАктивовИОбязательств</types>
  </type>
  <predefined>
    <items>
      <name>ВидыНоменклатуры</name>
      <description>Виды номенклатуры</description>
      <code>000000016</code>
      <type>
        <types>CatalogRef.ВидыНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>ГруппыАналитическогоУчетаНоменклатуры</name>
      <description>Группы аналитического учета номенклатуры</description>
      <code>000000034</code>
      <type>
        <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>ДенежныеСредстваБюджетирования</name>
      <description>Денежные средства</description>
      <code>000000011</code>
      <type>
        <types>CatalogRef.КассыККМ</types>
        <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
        <types>CatalogRef.Кассы</types>
      </type>
    </items>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
        <types>CatalogRef.ДоговорыАренды</types>
      </type>
    </items>
    <items>
      <name>Заказы</name>
      <description>Заказы</description>
      <code>000000036</code>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаказПереработчику</types>
        <types>DocumentRef.ЗаказНаСборку</types>
        <types>DocumentRef.ЗаказПереработчику2_5</types>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </items>
    <items>
      <name>КоллекцииНоменклатуры</name>
      <description>Коллекции</description>
      <code>000000033</code>
      <type>
        <types>CatalogRef.КоллекцииНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Марки</name>
      <description>Марки (бренды)</description>
      <code>000000028</code>
      <type>
        <types>CatalogRef.Марки</types>
      </type>
    </items>
    <items>
      <name>НаправленияДеятельности</name>
      <description>Направления деятельности</description>
      <code>000000015</code>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </items>
    <items>
      <name>НематериальныеАктивы</name>
      <description>Нематериальные активы и расходы на НИОКР</description>
      <code>000000018</code>
      <type>
        <types>CatalogRef.НематериальныеАктивы</types>
      </type>
    </items>
    <items>
      <name>НоменклатураБюджетирования</name>
      <description>Номенклатура</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>ОбъектыСтроительства</name>
      <description>Объекты строительства</description>
      <code>000000035</code>
      <type>
        <types>CatalogRef.ОбъектыСтроительства</types>
      </type>
    </items>
    <items>
      <name>ОбъектыЭксплуатации</name>
      <description>Объекты эксплуатации</description>
      <code>000000017</code>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </items>
    <items>
      <name>Организации</name>
      <description>Организации</description>
      <code>000000023</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>Партнеры</name>
      <description>Партнеры</description>
      <code>000000024</code>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </items>
    <items>
      <name>Подразделения</name>
      <description>Подразделения</description>
      <code>000000014</code>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </items>
    <items>
      <name>Проекты</name>
      <description>Проекты</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </items>
    <items>
      <name>Производители</name>
      <description>Производители</description>
      <code>000000027</code>
      <type>
        <types>CatalogRef.Производители</types>
      </type>
    </items>
    <items>
      <name>СтатьиАктивовИПассивов</name>
      <description>Прочие активы и пассивы</description>
      <code>000000019</code>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </items>
    <items>
      <name>ПрочиеРасходы</name>
      <description>Прочие расходы</description>
      <code>000000020</code>
      <type>
        <types>CatalogRef.ПрочиеРасходы</types>
      </type>
    </items>
    <items>
      <name>СезонныеГруппы</name>
      <description>Сезонные группы</description>
      <code>000000031</code>
      <type>
        <types>CatalogRef.СезонныеГруппы</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </items>
    <items>
      <name>СтатьиАктивовПассивов</name>
      <description>Статьи активов и пассивов</description>
      <code>000000022</code>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </items>
    <items>
      <name>СтатьиДвиженияДенежныхСредств</name>
      <description>Статьи ДДС</description>
      <code>000000007</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>СтатьиДоходов</name>
      <description>Статьи доходов</description>
      <code>000000009</code>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
      </type>
    </items>
    <items>
      <name>СтатьиКалькуляции</name>
      <description>Статьи калькуляции</description>
      <code>000000008</code>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </items>
    <items>
      <name>СтатьиРасходов</name>
      <description>Статьи расходов</description>
      <code>000000010</code>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </items>
    <items>
      <name>ТипыДенежныхСредств</name>
      <description>Типы денежных средств</description>
      <code>000000012</code>
      <type>
        <types>EnumRef.ТипыДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>ТипыНоменклатуры</name>
      <description>Типы номенклатуры</description>
      <code>000000013</code>
      <type>
        <types>EnumRef.ТипыНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>ТоварныеКатегории</name>
      <description>Товарные категории</description>
      <code>000000030</code>
      <type>
        <types>CatalogRef.ТоварныеКатегории</types>
      </type>
    </items>
    <items>
      <name>ФизическиеЛица</name>
      <description>Физические лица</description>
      <code>000000021</code>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
    <items>
      <name>ФорматыМагазинов</name>
      <description>Форматы магазинов</description>
      <code>000000032</code>
      <type>
        <types>CatalogRef.ФорматыМагазинов</types>
      </type>
    </items>
    <items>
      <name>ЦеновыеГруппы</name>
      <description>Ценовые группы</description>
      <code>000000029</code>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </items>
    <items>
      <name>ОбъектыРасчетов</name>
      <description>Объекты расчетов</description>
      <code>000000037</code>
      <type>
        <types>CatalogRef.ОбъектыРасчетов</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>ЗаполнениеВалюты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеЕдиницыИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВалюты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЕдиницыИзмерения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПоВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПоКоличеству</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеСвойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеТипаЗначения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

ka2_2024/src/ChartsOfCharacteristicTypes/АналитикиСтатейБюджетов/Forms/НастройкаТипаАналитики/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ТипЗначения = Параметры.ТипЗначения;
	ДополнительноеСвойство = Параметры.ДополнительноеСвойство;
	ДоступныеТипы = Метаданные.ПланыВидовХарактеристик.АналитикиСтатейБюджетов.Тип;
	
	ЗаполнитьДеревоТипов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДеревоТиповПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоТипов.ТекущиеДанные;
	
	Если ТекущиеДанные.Пометка Тогда
		ЭлементыДерева = ДеревоТипов.ПолучитьЭлементы();
		ВыбранныйТип = Новый Структура;
		ВыбранныйТип.Вставить("Тип",                    ТекущиеДанные.Тип);
		ВыбранныйТип.Вставить("ДополнительноеСвойство", ТекущиеДанные.ДополнительноеСвойство);
		НесовместимыеТипы = Новый Массив;
		ПроверитьСовместноеИспользованиеТиповРекурсивно(ЭлементыДерева, ВыбранныйТип, НесовместимыеТипы);
		
		Если НесовместимыеТипы.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВыбранныйТип",      ТекущиеДанные);
		ДополнительныеПараметры.Вставить("НесовместимыеТипы", НесовместимыеТипы);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОтключениеНесовместимыхТипов", ЭтаФорма, ДополнительныеПараметры);
		Если НесовместимыеТипы.Количество() = 1 Тогда
			ТекстВопроса = НСтр("ru = 'Ранее были выбран тип несовместимый с текущим. 
				|Для использования выбранного типа необходимо отключить несовместимый. Отключить?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Ранее были выбраны типы несовместимые с текущим. 
				|Для использования выбранного типа необходимо отключить несовместимые типы. Отключить?'");
		КонецЕсли;
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТиповПриАктивизацииСтроки(Элемент)
		
	ТекущиеДанные = Элементы.ДеревоТипов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	СтрокаДляПроверки = ?(Родитель = Неопределено,ТекущиеДанные,Родитель);
	
	Если ВидКонтекстногоМеню = СтрокаДляПроверки.ПредставлениеТипа Тогда
		Возврат;
	КонецЕсли;
	
	ВидКонтекстногоМеню = СтрокаДляПроверки.ПредставлениеТипа;
	
	СтрокаДополнительныеРеквизиты = НСтр("ru = 'Дополнительные реквизиты'");
	СтрокаДополнительныеСведения = НСтр("ru = 'Дополнительные сведения'");

	Элементы.ДеревоТиповКонтекстноеМенюСоздатьСвойство.Видимость = Ложь;
	Элементы.ДеревоТиповКонтекстноеМенюСоздатьДополнительныйРеквизит.Видимость = Ложь;

	Если СтрокаДляПроверки.ПредставлениеТипа = СтрокаДополнительныеРеквизиты Тогда
		Элементы.ДеревоТиповКонтекстноеМенюСоздатьДополнительныйРеквизит.Видимость = Истина;	
	ИначеЕсли СтрокаДляПроверки.ПредставлениеТипа = СтрокаДополнительныеСведения Тогда
		Элементы.ДеревоТиповКонтекстноеМенюСоздатьСвойство.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДополнительноеСведение(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", Истина);
	
	Оповещение = Новый ОписаниеОповещения("СозданиеДополнительногоСвойства", ЭтаФорма);
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Форма.ФормаЭлемента", 
		ПараметрыФормы, ЭтаФорма, , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДополнительныйРеквизит(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", Ложь);
	
	Оповещение = Новый ОписаниеОповещения("СозданиеДополнительногоСвойства", ЭтаФорма);
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Форма.ФормаЭлемента", 
		ПараметрыФормы, ЭтаФорма, , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТипЗначения = Новый ОписаниеТипов();
	ДополнительноеСвойство = Неопределено;
	
	ВыбранныеТипыРекурсивно(ДеревоТипов.ПолучитьЭлементы());
	
	Результат = Новый Структура;
	Результат.Вставить("ТипЗначения",            ТипЗначения);
	Результат.Вставить("ДополнительноеСвойство", ДополнительноеСвойство);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЗначения(Команда)
	
	ТекущиеДанные = Элементы.ДеревоТипов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ТекущиеДанные.Ссылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДополнительноеСвойство) Тогда
		ПоказатьЗначение(,ТекущиеДанные.ДополнительноеСвойство);
	Иначе
		ИмяФормыСписка = ИмяФормыСпискаПоТипу(ТекущиеДанные.Тип);
		ОткрытьФорму(ИмяФормыСписка, , ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоТипов()
	
	ДеревоТипов.ПолучитьЭлементы().Очистить();
	
	ДобавитьПредопределенныеТипы();
	ДобавитьДополнительныеСвойства();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПредопределенныеТипы()
	
	ИспользоватьПартнеровКакКонтрагентов = ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов");
	
	СтрокаПредопределенныеТипы = ДеревоТипов.ПолучитьЭлементы().Добавить();
	СтрокаПредопределенныеТипы.ПредставлениеТипа = НСтр("ru = 'Предопределенные типы'");
	
	Для каждого Тип Из ДоступныеТипы.Типы() Цикл
		Если Тип = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИспользоватьПартнеровКакКонтрагентов 
			И Тип = Тип("СправочникСсылка.Контрагенты") Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = СтрокаПредопределенныеТипы.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Пометка = ТипЗначения.СодержитТип(Тип);
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип);
		НоваяСтрока.Тип = Новый ОписаниеТипов(МассивТипов);
		НоваяСтрока.ПредставлениеТипа = Метаданные.НайтиПоТипу(Тип).Представление();
		НоваяСтрока.Ссылка = Новый (Тип);
		
		Если НоваяСтрока.Пометка Тогда
			Элементы.ДеревоТипов.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДополнительныеСвойства()
	
	СтрокаДополнительныеРеквизиты = ДеревоТипов.ПолучитьЭлементы().Добавить();
	СтрокаДополнительныеРеквизиты.ПредставлениеТипа = НСтр("ru = 'Дополнительные реквизиты'");
	
	СтрокаДополнительныеСведения = ДеревоТипов.ПолучитьЭлементы().Добавить();
	СтрокаДополнительныеСведения.ПредставлениеТипа = НСтр("ru = 'Дополнительные сведения'");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Свойства.Ссылка КАК ДополнительноеСвойство,
	|	Свойства.Представление КАК Представление,
	|	Свойства.ТипЗначения,
	|	Свойства.ЭтоДополнительноеСведение
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК Свойства
	|
	|УПОРЯДОЧИТЬ ПО
	|	Свойства.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Типы = Выборка.ТипЗначения.Типы();
		Если Типы.Количество() > 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ДоступныеТипы.СодержитТип(Типы[0]) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.ЭтоДополнительноеСведение Тогда
			НоваяСтрока = СтрокаДополнительныеСведения.ПолучитьЭлементы().Добавить();
		Иначе
			НоваяСтрока = СтрокаДополнительныеРеквизиты.ПолучитьЭлементы().Добавить();
		КонецЕсли;
		НоваяСтрока.ДополнительноеСвойство = Выборка.ДополнительноеСвойство; 
		НоваяСтрока.Пометка = (Выборка.ДополнительноеСвойство = ДополнительноеСвойство);
		НоваяСтрока.Тип = Выборка.ТипЗначения;
		НоваяСтрока.ПредставлениеТипа = Выборка.Представление;
		 
		НоваяСтрока.Ссылка = Новый (Типы[0]);
		
		Если НоваяСтрока.Пометка Тогда
			Элементы.ДеревоТипов.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ИмяФормыСпискаПоТипу(ОписаниеТипов)
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ОписаниеТипов.Типы()[0]);
	Возврат ОбъектМетаданных.ПолноеИмя() + ".ФормаСписка";
	
КонецФункции

&НаКлиенте
Функция ВыбранныеТипыРекурсивно(ЭлементыДерева)
	
	Для каждого Элемент Из ЭлементыДерева Цикл
		Если Элемент.Пометка Тогда
			ТипЗначения = Новый ОписаниеТипов(ТипЗначения, Элемент.Тип.Типы());
			ДополнительноеСвойство = Элемент.ДополнительноеСвойство;
		КонецЕсли;
		ВыбранныеТипыРекурсивно(Элемент.ПолучитьЭлементы());
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьСовместноеИспользованиеТиповРекурсивно(ЭлементыДерева, ВыбранныйТип, НесовместимыеТипы) 
	
	Для каждого ЭлементДерева Из ЭлементыДерева Цикл
		
		ЭтоВыбранныйТип = 
			(ЭлементДерева.Тип = ВыбранныйТип.Тип 
			И ЭлементДерева.ДополнительноеСвойство = ВыбранныйТип.ДополнительноеСвойство);
			
		Если ЭлементДерева.Пометка И Не ЭтоВыбранныйТип Тогда
			// 1. Нельзя выбирать дополнительное свойство совместно с другими предопределенными типами или дополнительными свойствами
			// 2. Нельзя выбирать предопределенный тип совместно с дополнительными свойствами.
			Если ЗначениеЗаполнено(ВыбранныйТип.ДополнительноеСвойство) 
				Или ЗначениеЗаполнено(ЭлементДерева.ДополнительноеСвойство) Тогда
				НесовместимыеТипы.Добавить(ЭлементДерева);
			КонецЕсли;
		КонецЕсли;
		ПроверитьСовместноеИспользованиеТиповРекурсивно(ЭлементДерева.ПолучитьЭлементы(), ВыбранныйТип, НесовместимыеТипы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОтключениеНесовместимыхТипов(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Для каждого НесовместивыйТип Из ДополнительныеПараметры.НесовместимыеТипы Цикл
			НесовместивыйТип.Пометка = Ложь;
		КонецЦикла;
	Иначе
		ДополнительныеПараметры.ВыбранныйТип.Пометка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеДополнительногоСвойства(Результат, ДополнительныеПараметры) Экспорт
	
	ЗаполнитьДеревоТипов();
	
КонецПроцедуры

#КонецОбласти
